# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+TITLE: Linguistic Bias in Crowdsourced Articles and the Aspect of Time
#+AUTHOR: Evangelos Mathioudis
#+STARTUP: overview indent inlineimages
#+LANGUAGE: pt-br
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:nil title:nil date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LATEX_CLASS: ACMART
#+LATEX_CLASS_OPTIONS: [format=acmsmall, review=false, screen=true]
#+LATEX_CLASS_OPTIONS: [twocolumn, sigconf]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{indentfirst}

** Code                                                             :ignore:
#+begin_src ipython :eval never-export :session session01 :exports none :results none
import numpy as np
import pandas as pd
import json
from utils import frequencies, mean_abstract_level
from tabulate import tabulate

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# Loading the biographies

with open('/home/emath/Data Science/AI Lab-Research/Wikipedia Project/Data/biographies_rev_history_new.json', 'r') as read_file:
    revisions = json.load(read_file)
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# Clear out the revisions that doesn't contain any content
for name in revisions.keys():
    print(name)
    counter = 0 # we keep track of how many revisions per biography have been deleted
    revisions_to_be_deleted = []
    for rev_id in revisions[name].keys():
        if len(revisions[name][rev_id]['content']) == 0:
            # delete all the revisions that don't have content
            # the content has been deleted prior to our analysis
            revisions_to_be_deleted.append(rev_id)
            counter += 1
    for rev_id in revisions_to_be_deleted:
        del revisions[name][rev_id]
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# load the didaxto's dictionaries

with open("/home/emath/Data Science/AI Lab-Research/Wikipedia Project/Data/neg_domain_words.txt", "rb") as read_file:
    neg_domain_words = set(line.decode(errors='ignore').strip() for line in read_file)
    
with open("/home/emath/Data Science/AI Lab-Research/Wikipedia Project/Data/pos_domain_words.txt", "rb") as read_file:
    pos_domain_words = set(line.decode(errors='ignore').strip() for line in read_file)
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# Build lists to create a dataframe
columns = ['name', 'revision Id', 'Date', 'length', 
           'pos_words', 'neg_words', 'adjectives',
           'verbs', 'adverbs'] 
values = []
posTags = {}
for name in revisions.keys():
    i=0
    for revid in revisions[name].keys():
        content = revisions[name][revid]['content']
        pos, neg, adj, verbs, adverbs, length = frequencies(content, posTags, pos_domain_words, neg_domain_words)
        values.append([name, revid, revisions[name][revid]['timestamp'], length, pos, neg, adj, verbs, adverbs])
        i += 1

revisions_df = pd.DataFrame(data=values, columns=columns)
revisions_df['mean_abstract_level'] = mean_abstract_level(revisions_df)
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results raw drawer
revisions_df.info()
#+end_src

#+RESULTS:
:results:
# Out[6]:
:end:

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# create a dataframe. Each row represents a revision for a specific biography
revisions_df['Date'] = pd.to_datetime(revisions_df['Date'])
revisions_df['pos_ratio'] = revisions_df['pos_words']/revisions_df['length']
revisions_df['neg_ratio'] = revisions_df['neg_words']/revisions_df['length']
revisions_df['adj_ratio'] = revisions_df['adjectives']/revisions_df['length']
revisions_df['vb_ratio'] = revisions_df['verbs']/revisions_df['length']
revisions_df['adv_ratio'] = revisions_df['adverbs']/revisions_df['length']

# print("#+CAPTION: Results") 
# print(tabulate(revisions_df.describe()
# , headers='keys', tablefmt='orgtbl', showindex='always'))
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
# We replace NaN values in "Mean Abstract Level" column with 0's
revisions_df["mean_abstract_level"] = revisions_df["mean_abstract_level"].fillna(0)

def gender(row: str):
    """
    Goes through all the names and returns 'm' if
    the name belong to a male or 'f' otherwise.
    """
    if row in  ["Recep Tayyip Erdoğan", "Emmanuel Macron", "Kyriakos Mitsotakis"]:
        return "m"
    else:
        return "f"

# Create a new column "Gender"
revisions_df["gender"] = revisions_df["name"].apply(gender)
#+end_src

#+begin_src ipython :eval never-export :session session01 :exports none :results none
revisions_df.groupby("gender").agg({"length":"mean", "mean_abstract_level":"mean"})

print("#+CAPTION: Results") 
print(tabulate(revisions_df.groupby("gender").agg({"length":"mean", "mean_abstract_level":"mean"})
, headers='keys', tablefmt='orgtbl', showindex='always'))
#+end_src
